# CurtainPanelTilePattern Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Family..::..CurtainPanelTilePattern Property
Family Class See Also
---
For Curtain Panel families, the choice of tile pattern.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public TilePatternsBuiltIn CurtainPanelTilePattern { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CurtainPanelTilePattern As TilePatternsBuiltIn
	Get
```

Visual C++
---
```text
public:
property TilePatternsBuiltIn CurtainPanelTilePattern {
	TilePatternsBuiltIn get ();
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown if this family is not a Curtain Panel family. |

# See Also
Family Class
Autodesk.Revit.DB Namespace